pesp-jboss/cms-external-sources/tests/test_files/soap/PHYS_testSearchByName_PaginatedAndSorted_req.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.services.screening.medicaid.gov/">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:searchByName>
         <arg0>
            <lastName>smith</lastName>
            <pageNumber>2</pageNumber>
            <pageSize>10</pageSize>
            <sortColumn>firstName</sortColumn>
         </arg0>
      </impl:searchByName>
   </soapenv:Body>
</soapenv:Envelope>